blogs/one-instance-cpu-is-higher-than-other.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-22 日 12:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>同业务内，某实例CPU异常高</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="zhengzhiyong" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">同业务内，某实例CPU异常高</h1>
<p>
问题的现象：同业务有多个k8s实例，在QPS相同的情况下，某个实例的CPU使用率是其它实例的两倍。
</p>

<div id="outline-container-org1352712" class="outline-2">
<h2 id="org1352712"><span class="section-number-2">1</span> CPU性能指标</h2>
<div class="outline-text-2" id="text-1">
<p>
QPS、CPU使用率体现到CPU上是IPS、IPC，通常这两个指标可以指引后续的排查。
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">实例</th>
<th scope="col" class="org-left">IPS</th>
<th scope="col" class="org-right">IPC</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">正常</td>
<td class="org-left">7,823,662,928</td>
<td class="org-right">1.18</td>
</tr>

<tr>
<td class="org-left">异常</td>
<td class="org-left">17,944,647,861</td>
<td class="org-right">1.12</td>
</tr>
</tbody>
</table>

<ol class="org-ol">
<li>正常、异常实例的IPC相差不大，但是IPS差了1倍，和CPU使用率的差异吻合;</li>
<li>QPS相同，但是IPS不同，说明实例的很多指令在做QPS无关的事情。</li>
</ol>
</div>
</div>

<div id="outline-container-org4d9303f" class="outline-2">
<h2 id="org4d9303f"><span class="section-number-2">2</span> IPS 差异</h2>
<div class="outline-text-2" id="text-2">
<p>
可以从IPS的差异入手，参考之前的：
</p>

<p>
最简单的方法，是看TOP线程的情况。我司的代码，会根据线程的功能，命名线程。（C语言可以使用 <code>pthread_setname_np</code> ，Java语言也有相关API。）
</p>

<p>
<code>top -H -p &lt;pid&gt;</code> 发现如下差异：
</p>
<ol class="org-ol">
<li>异常实例有很多的rdk线程，有40多个 <code>ps -L -p &lt;pid&gt; | wc -l</code> ;</li>
<li>正常实例则没有rdk线程。</li>
</ol>

<p>
业务同学根据这个差异，很快定位到是配置错误。修改之后各个实例的CPU使用率均衡了。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: zhengzhiyong</p>
<p class="date">Created: 2023-10-22 日 12:29</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
